app/controllers/categories_controller.rb

SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "memos".* FROM "memos" WHERE "memos"."category_id" = ?  [["category_id", 3]]
---
    def show
        @category = Category.find(params[:id])
        @memos = Memo.where(category_id: params[:id])