app/controllers/memos_controller.rb

  def index
    #トップページ
    @memos=Memo.all
---
SELECT "memos".* FROM "memos"

  def new
    #新規作成ページ
    @categories=Category.all
---
SELECT "categories".* FROM "categories"

  def create
    #新しいメモがフォームからpostされた際
    Memo.create(title:params["memos"]["title"], body:params["memos"]["body"],category_id:params["memos"]["category_id"])
---
INSERT INTO "memos" ("title", "body", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?)  [["title", "記事更新"], ["body", "1記事書く"], ["created_at", "2022-12-18 08:50:41.763380"], ["updated_at", "2022-12-18 08:50:41.763380"], ["category_id", 3]]

  def destroy
    memo = Memo.find(params["id"])
    memo.destroy
---
SELECT  "memos".* FROM "memos" WHERE "memos"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "memos" WHERE "memos"."id" = ?  [["id", 4]]

  def edit
    @memo= Memo.find(params["id"])
---
SELECT  "memos".* FROM "memos" WHERE "memos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    memo= Memo.find(params["id"])
    memo.title = params["memos"]["title"]
    memo.body= params["memos"]["body"]
    memo.category_id = params["memos"]["category_id"]
    memo.save
---
SELECT  "memos".* FROM "memos" WHERE "memos"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "memos" SET "category_id" = ?, "updated_at" = ? WHERE "memos"."id" = ?  [["category_id", 2], ["updated_at", "2022-12-19 14:12:12.761523"], ["id", 6]]